InformationRegisters/ТК_УчетнаяПолитикаТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_УчетнаяПолитикаТорговыхПлощадок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_УчетнаяПолитикаТорговыхПлощадок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает запись в регистре по переданным данным.
//
//	Параметры:
//		Организация - СправочникСсылка - ссылка на элемент справочника "Организации".
//		Период - Дата - Период записи регистра.                                       
//		ТорговаяПлощадка - СправочникСсылка - ссылка на элемент справочника "Торговые Площадки".
//
Процедура СоздатьЗаписьРегистра(Знач ТорговаяПлощадка, Период, Знач Организация) Экспорт
	
	Если ТорговаяПлощадка = Неопределено ИЛИ ТорговаяПлощадка = Справочники.ТорговыеПлощадки.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	

	НоваяЗапись = РегистрыСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = НачалоГода(ТекущаяДатаСеанса());
	НоваяЗапись.ТорговаяПлощадка = ТорговаяПлощадка;
	НоваяЗапись.Организация = Организация;
	НоваяЗапись.Период = Период;
	Попытка
		НоваяЗапись.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='Запись в регистр сведений Учетная политика торговых площадок';uk='Запис в регістр відомостей Облікова політика торгових майданчиків'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Функция возвращает действующую организацию .
//
//	Параметры:
//		ТорговыеПлощадки - СправочникСсылка - ссылка на элемент справочника "ТорговыеПлощадки".
//		Период - Дата - Дата, на которую необходимо получить действующую организацию.
//
Функция ПараметрыУчетнойПолитики(ТорговаяПлощадка, Период) Экспорт
	//
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&Период, ТорговаяПлощадка = &ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних");

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	
	Возврат Выборка.Организация;
	
КонецФункции

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТорговаяПлощадка)	
	|	И ЗначениеРазрешено(Организация)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбновлениеИнформационнойБазы


#КонецОбласти

#КонецЕсли
